<template>
  <div>
    <div v-if="login">
      <gu></gu>
    </div>

    <div v-else>
      <div v-for="(i,k) of item" :key="k" class="x">
        <div v-if="i.exef" >
          <div class="hidbg">
            <p>{{i.ps}}发表了文章 - {{i.time}}天前</p>
            <h2>{{i.tit}}</h2>
            <div>
              <img :src="i.img" class="image" />
            </div>
            <div>
              <p class="show">{{i.content}}</p>
            </div>
            <div class="showbut">
              <a href="#" @click.stop.prevent="show(i)">
                阅读全文
                <span class="down"></span>
              </a>
            </div>
           
          </div>
        </div>
        <div v-else >
          <div class="showbg">
            <p>{{i.ps}}发表了文章 - {{i.time}}天前</p>
            <h2>{{i.tit}}</h2>

            <div>
              <img :src="i.img" class="photo" />
              {{i.content}}
            </div>
            <div class="hidbut">
                
                     <a href="#" class="sq" @click.stop.prevent="hid(i)">收起 <span class="up"></span></a>
            </div>
          </div>
        </div>
            <show :zhan='i.zhan'  @jia='jia(i)' :ztt='i.ztt' :scc='i.scc'  @sc="sc(i)"></show>
      </div>
    </div>
  </div>
</template>
<script>
import show from '../components/gong'
import gu from "../components/gujia"
export default {
  data() {
    return {
      
        sc1: [],
      login: true,
      item: [
        {
          tit: "在男生眼里，什么样的女孩才是好姑娘？",
          exef: true,
          ps: "张三",
          time: 1,
            zhan:0,
             ztt: true,
          scc: true,
          img: require("../../image/nv.jpg"),
          content:
            "昨夜我梦中惊醒，翻开历史一查，发现这历史根本就没有年代，每页歪歪斜斜地都写着“物化人性”四个字，我横竖睡不着，仔细看到了后半夜，才从字缝里依稀地看出了两个字——“吃人”。“什么样的女孩才是好姑娘”一直是极端男权和田园女权的必争之地。守护男权的人会告诉你：好姑娘是要学会温柔体贴、贤良淑德、善解人意，做好贤内助、辅佐好丈夫的事业工作。你要负责繁衍，你要活成一个妻子、母亲该有的样子。在这些人眼中，你抽烟、喝酒、纹身就不是一个好姑娘该有的样子。他们批判、鄙视、排斥你，只是因为你没有活成他们眼中所期待的模样。田园女权的人告诉你：好姑娘是要学会如何花掉男人的钱，天性赐予了你繁衍的能力，那么你就应该享受到更多地权利。你不能接受“廉价”的婚姻，你也不能接受一个“廉价”的男人。在这些人眼中，你不会花钱、家庭主妇、没有事业就不是一个好女孩该有的样子。她们批判、鄙视、排斥你，只是因为你没有活成她们眼中所期待的模样。发现没有，你如果永远活在别人的标准里，总会有人站出来告诉你“你不该这样活，你不是一个好女孩儿”，于是你改变、你照做不误，结果呢？你丢失了自己的三观，同样也丢掉了自我。到底什么样的女孩才是好姑娘？我来给你一个答案。在社会的基本道德之上，你活成了自己最舒服的模样，那么你就是一个好女孩儿。你没有必要去因为别人的标准去改变自己，即使你竭尽全力地活成别人眼中的好，但是扪心自问一下：为了别人而活的自己，你真的喜欢么？你想成为一个什么样的人、你是不是一个好女孩儿，没有能给你一个准确的定义，这只有你自己最清楚。“一个女孩的好，更多的是来自于她身上散发的善良与爱意，而不是在各种一套套标准下活着的躯壳。”现在的这个社会，无论对于男生还是女生的要求太多了。于是营销和流量会制定出一套又一套的所谓“好男孩”“好女孩”的标准，一边引导着社会潮流的三观、一边又压抑每个人天然的样子。不评价男生和女生，其实是对这个人最好的评价。因为每一个人都有自己活成什么样的权利，没有一个人能够以自己的标准去为别人贴上标签。有很多空窗期时间长、处于焦虑的女生咨询过我这样一个问题：自己长时间没有得到缘分的青睐，是不是自己不够好、是不是没有成为大多数人眼中的好女孩？我的回答是：缘分很多时候会迟到，但是属于你的缘分一定不会缺席。不是你做的不够好，而是你可以做的更好、去为自己创造更大的吸引。你现在要做的并不是活在自我质疑的阴影中，更不是根据别人口中所谓的“好”而去盲目地改变自己。而是你要做到是永远开心地、努力地向前奔跑，让自己一直处于变得优秀的路上。活成一个自己想要成为的样子，舒适着又不在意别人的眼光，缘分自然会眷顾一个不断努力且自信的你。要记住：你若盛开，蝴蝶自来。你是一朵热情奔放的玫瑰也好、或是一段娇羞内敛的百合也罢，爱你的人终究会穿过茫茫人海、循香而来，盛开的你便不再孤独。很多时候并不是世界与你格格不入，你的独特反而是一种别样的魅力。百花齐放是美，同样一枝独秀也是。因为所谓的“好与坏、美与丑”本身就是人来自于人的主观定义，用社会的基本道德去认清自己，自信且独立地拥抱生活，让自己一直处于优秀的道路上，这样你的才不会在各种价值观的横流中迷失自我。同样与一个你爱的、又爱你的人相处，你自然就能找到“对于自己的定义和价值”。世界中的好坏，不再别人的标准里，而是需要你在爱中不断地摸索和改变。人们对于所谓“好女孩”的评判有成千上万种，这些你看看就好。但“适配于你”的好，需要你在爱情、家庭、社会中不断地去定义，找到一个另自己舒适、也能让爱的人接受，这样的好女孩，才是真正适合你的、才是有价值和意义的。人向来没有所谓的三六九等，同样也没有绝对的“好与坏”。在基本道德之上，寻求一个舒适、最适合自己的生活态度，能够不断地提升自己的价值、积极地拥抱生活，这对于你来说足矣。千万别让自己活在别人的标准中，对待营销式的三观横流要学会做一个理性的旁观者。没有人能够改变你，你的“好”只能由你来定义。最后送给你一句话：愿你一生温暖纯良，不舍爱与自由。"
        },
        {
          tit: "高三生物可以速成吗？",
          exef: true,
          ps: "王欢",
          time: 1,
            zhan:0,
            ztt: true,
          scc: true,
          img: require("../../image/gk.jpg"),
          content:
            "”非常负责任的说，就算你高一高二上课没有认真听过生物，只要一个月时间，绝对可以做到高考不拉分。前提是你肯下功夫背。理综里生物占90，只要你看了下边这些干货（都是一些学霸总结的例题，比看书省时多了，适用于基础差的同学，因为都是一些考试大概率出现的基础题，学霸请自行跳过），并且认真做了，高考生物70+没有任何问题。"
        },
        {
          tit:
            "怎么看待“就这，就这”、“不会吧，不会吧”、“他急了，他急了”、“你品，你细品”系列网络词汇？",
          exef: true,
          ps: "二郎",
          time: 1,
            zhan:0,
            ztt: true,
          scc: true,
          img: require("../../image/tjl.jpg"),
          content:
            "你还记得“蓝瘦香菇”吗？你还记得“元芳，你怎么看”吗？你还记得“吓死宝宝了”吗？你还记得“整个人都不好了”吗？网络用语嘛，每年都有，每年也都有人来问怎么看待。能怎么看待，忍一忍就过去了。偶尔用一用也无妨，大量使用的话，这词汇就容易过气，甚至会产生恶心干呕的症状，典型如“蓝瘦香菇”。只是听我一句劝，不要老是用网络用语来发朋友圈及QQ空间，不然几年后再回首，那滋味可不好受。你试想想，假如下面是你这些年发的朋友圈。2019年：刚走到马路边，绿灯就跳转为红灯，我太南了。那么红的红灯，像极了爱情。2018年：这红灯竟然要120秒，一首凉凉送给我自己。算了，我也算个佛系路人，那就慢慢等吧。2017年：好不容易等到绿灯，刚踏入斑马线，结果一辆右转车飞奔而过差点撞到我，还有这种操作？司机你的良心不会痛吗？2016年：哼，一言不合就开那么快的车。我愣了一会儿，结果又红灯了，蓝瘦香菇。2015年：这时，另一辆右转车开过来，并向我鸣笛DUANG，吓死宝宝了。这些车也太不把我叶良辰放在眼里了吧？人家还只是个小公举啊，我的内心几乎是崩溃的。2014年：不得不退回人行道的我，现在整个人都不好了。只能且行且珍惜了，毕竟我只想做个安静的美男子。2013年：又是120秒的红灯，我去年买了个表，硬生生把我逼成了女汉子，感觉不会再爱了。2012年：为什么我过个马路这么难，这难道就是传说中的中国式过马路吗？真是鸭梨山大呀！元芳，你怎么看？2011年：有人说我在吹牛，哪有人这样过马路的。哎，不管你们信不信，反正我是信了。普通青年的我，真是伤不起。2010年：哎，你们不信就不信吧，神马都是浮云，我爸又不是李刚，没能让你们都相信。你品，你细品，这就是这些年的网络热词。就这，就这，是不是很尴尬？竟然有人觉得还好，不会吧，不会吧？然后还给我点赞？他急了，他急了。"
        },
        {
          tit: "高考化学实验题要怎么处理？",
          exef: true,
          ps: "佳乐",
          time: 1,
            zhan:0,
             ztt: true,
          scc: true,
          img: require("../../image/bp.jpg"),
          content:
            "又邀请我了，我懂我懂，最近快高考了，各位同学化学的实验题部分有问题，需要一些干货，不过这次在收藏的时候，记得点个赞，不要做一个光荣的白嫖党。实验题作为化学高考的常驻嘉宾，量级（分值）一直挺高的，近几年这个嘉宾咖位越来越大了，不过这个难度却往下走，不过越来越新了，跟数学全国卷一样，靠新来掩饰难度下降的事实。不过化学题不管怎么考，玩综合还是玩探究，都逃不过那句话——高考以纲为纲，以本为本。超纲部分？超纲部分也在最基本的实验思路里面。那么怎么搞定这个化学实验题，很简单，从最基础出发，把高中化学所有学习过的实验都总结一下，它会用到哪些实验装置，这些实验装置有什么注意事项（比如学化学的人在洗碗的时候会与众不同），这个实验的原理是什么，这个实验会有什么现象，有什么结论，产生了误差， 怎么分析这个误差，为什么会产生误差，等等。下面进入你们最爱的分（bai）享（piao）干货环节。先把目录扔上来，各取所需，快高考了时间很重要。1.高中化学实验操作七原则2.高中化学常考的17个实验3.化学实验80例常见现象4.常见物质分离提纯的10种方法（超级有用，经常会考）5.常见去除杂质的10种方法（同上）6.化学实验基本操作中的15“不”能做7.实验中导管和漏斗的位置的放置方法8.化学实验中的先与后22例9.滴加顺序不同，现象不同10.水在化学实验中的妙用11.化学实验题三类题型的温馨提示。"
        },
        {
          tit: "倒退30年，中国电影有多敢拍？",
          exef: true,
          ps: "蒋红",
          time: 1,
            zhan:0,
              ztt: true,
          scc: true,
          img: require("../../image/dy.jpg"),
          content: `截止今天，全国电影院已经关闭近150天了，相信很多影迷们都坐不住了。前段时间，豆瓣上还出了一个段子。有人说：疫情让中国电影业倒退三十年。有网友回复：还有这等好事？调侃归调侃，这个段子确实引起了广泛的共鸣。30年前，中国电影是什么样子？今天，君君就带大家回首那个“中国电影很牛B”的八九十年代。01 逆天尺度相信不少朋友，现在每看电影之前，都会问：“这片删减了吗？”没错，“删减”仿佛已经成了常态。但你绝对无法想象，我们曾经的大荧幕的“尺度”有多大。《红高粱》19881989年，《疯狂的代价》上映。海报上写着：“国内首部全裸出境的探索电影”“诱奸、仇杀、几近癫狂的偷窥"《疯狂的代价》被称作“院线公映的尺度最生猛的国产片”。电影开头，就是两个女孩的全luo片段，而且有男人在远处偷窥。接着，妹妹兰兰在雨夜里惨遭性侵，姐姐开始疯狂追寻凶手；
而案件侦破中，还有意想不到的反转……其实，这样的国产大尺度不少。
1995年，《阳光灿烂的日子》上映。
青春的荷尔蒙躁动、露骨的镜头和对白，还有超时代的反思和批判性。但直到前几个月，完整的140分钟才出现。
当然，那个年头，还有“没上台面”的电影。
1998年，年仅17岁的李小璐凭借《天浴》，拿下了金马奖最佳女主角电影讲述了文青文秀下乡跟老金学习牧马，随后自甘堕落，一点一点被摧毁的故事；
因为片中大量的不可言语戏码，电影被jin；
导演陈冲也被禁止拍片三年……
那个年代的中国电影，是没有“尺度”的；
同样，导演们的表达也是“意味深长”的。
02 意味深长
说起中国电影的巅峰，很多人第一反应是《霸王别姬》。
这部1993年的电影里，不仅有动荡的年代、禁忌的同性之爱、还有深刻的批判性；
每隔几年看，都有新的体会。但其实，早在1989年，谢晋就拍了一部很多人心中“中国最好的电影”——
《芙蓉镇》。
这部特殊时期的人物群像里，有心荡神摇的性欲描写，也有深沉的时代反思。
一句“活下去，像牲口一样活下去”，道尽了时代里命运多舛的沧桑。`
        }
      ]
    };
  },
  methods: {
    sc(i) {
      i.scc = !i.scc;
      if (i.scc) {
        this.sc1.splice(i,1);
        
      } else {
        this.sc1.push(i);
        
      }
       this.bus.$emit('sc',this.sc1)
    },
     jia(i){
     i.ztt=!i.ztt
      if(i.ztt){
        i.zhan-=1 
        console.log(this.ztt)
      }else{
        i.zhan+=1
      }
    },
    show: function(i) {
      i.exef = false;
    },
    hid: function(i) {
      i.exef = true;
    }
  },
  beforeMount: function() {
    setTimeout(() => {
      this.login = false;
    }, 500);
  },

  components: {
    gu,
    show
  }
};
</script>
<style scoped>
.photo {
  width: 80%;
}
.image {
  width: 190px;
  height: 105px;
  margin: 5px 5px 5px 0px;
  border-radius: 5px;
}
.hidbg {
  width: 600px;
  margin: 10px;
  padding: 10px 10px 0px 10px;
  position: relative;
}
.showbg {
  width: 600px;
  margin: 10px;
  padding: 20px 20px 0px 10px;
  font-size: 14px;
}
.show {
  overflow: hidden;
  text-overflow: clip;
  display: -webkit-box;
  -webkit-box-orient: vertical;
  -webkit-line-clamp: 2;
  font-size: 14px;
}
.hidbut {
  text-align: right;
}
.down {
  display: inline-block;
  width: 8px;
  height: 8px;
  border-right: solid 1px;
  border-bottom: solid 1px;
  transform: rotate(45deg);
  margin-bottom: 3px;
}
.up {
  display: inline-block;
  width: 8px;
  height: 8px;
  border-left: solid 1px;
  border-top: solid 1px;
  transform: rotate(45deg);
  margin-top: 3px;
}
.img {
  display: flex;
  margin-top: 10px;
}
.img a {
  color: black;
}
.img > div {
  margin: 10px;
}
.img img {
  vertical-align: middle;
}
.img div:first-child {
  margin-left: 0px;
  background-color: rgba(0, 132, 255, 0.2);
  width: 80px;
  height: 30px;
  text-align: center;
  line-height: 30px;
  position: relative;
}
.img div:first-child a {
  color: #0084ff;
  border-radius: 2px;
}
.jj {
  width: 36px;
  background-color: rgba(0, 132, 255, 0.2);
  border-radius: 2px;
  position: relative;
  right: 15px;
}
.sj {
  border: 5px solid #0084ff;
  border-top-color: transparent;
  border-left-color: transparent;
  border-right-color: transparent;
  position: absolute;
  left: 15px;
  bottom: 12px;
}
.js {
  border: 5px solid #0084ff;
  border-bottom-color: transparent;
  border-left-color: transparent;
  border-right-color: transparent;
  position: absolute;
  left: 12px;
  top: 12px;
}
.sq {
  line-height: 40px;
  color: #0084ff;
}
.x {
  border-bottom: 1px solid #f0f2f7;
}
</style>