<template>
  <div>
    <div v-if="login">
      <gu></gu>
    </div>

    <div v-else>
      <div v-for="(i,k) of item" :key="k" class="x">
        <div v-if="i.exef">
          <div class="hidbg">
            <h2>{{i.tit}}</h2>
            <p class="show">{{i.ps+":"+i.content}}</p>

            <div class="showbut">
              <a href="#" @click.stop.prevent="show1(i)">
                阅读全文
                <span class="down"></span>
              </a>
            </div>
          </div>
        </div>
        <div v-else>
          <div class="showbg">
            <h2>{{i.tit}}</h2>
            <p>{{i.ps+":"+i.content}}</p>
            <div class="hidbut">
              <a href="#" class="sq" @click.stop.prevent="hid(i)">
                收起
                <span class="up"></span>
              </a>
            </div>
          </div>
        </div>

        <show :zhan="i.zhan" :ping="i.ping" @jia="jia(i)" @sc="sc(i)" :scc='i.scc'  :ztt='i.ztt'></show>

        
      </div>
    </div>
  </div>
</template>
<script>
import show from "../components/gong";
import gu from "../components/gujia";
export default {
  data() {
    return {
      sc1: [],
      login: true,
      item: [
        {
          tit: "你认为家境重要吗？",
          exef: true,
          ps: "七心海棠",
          ping: false,
          zhan: 1,
          ztt: true,
          scc: true,
          content:
            "重要。试错成本低。我在人生几次关键转折点都犯了巨大错误。都让家长帮我掰回来了。中学偏科严重，混不下去就出国吧。先送去袋鼠国读中学吧。不喜欢？换个大陆。不好好学习，重修吧。语言班都挂了不止一次。不喜欢这个专业，换一个吧。等意识到了自己的问题开始奋发图强，家长给我提供了有力的后勤保障。租房要租舒适的，不做饭可以经常出去吃。暑假回国疯狂找家教补课。我好像是我听到的在国外上学补课的第一人。想申请研究生院了得有点科研成果，我干爸天天训练我带我水项目。（感谢评论区提醒，只是和国外研究生院证明我参与了他的研究，没有伤害到任何国内同学的利益，且我确实参与了）涉及到我爸妈研究领域的选修课，两位赤膊上阵，微信辅导。有些科目他们辅导不了，没有关系，还有他们的好友热情辅导。有个看着我长大的阿姨给我辅导了一学期宗教课。在她的指导下，我的论文次次A+。假设我智商达到正常人水平，在这么好的填鸭训练下，不可能没有效果。填鸭真的有用，比自己摸爬滚打舒服多了。水博士申请群，发现好多同学纠结于奖学金。我妈说只要你愿意读，咱们自费也行，你看看哪个国家压力小。我问问我的同事/朋友，看看他们推荐哪个国家。我压力大到炸的时候，我妈会给我一笔钱去旅游。不走马观花，就选自己喜欢的城市住半个月一个月。住舒服了再回来。我二十岁的时候我爸就把婚房买好了。让我无论和谁在一起，都没有后顾之忧。我真的超努力的，填鸭教育非常适合我这种又笨又努力的人。填鸭填鸭，鸭子得张嘴呀。现在很后悔刚出国的时候荒废时光。哪怕我不生在贫困山区，就算是生在县城工薪家庭，中学这么作估计现在就是高中没毕业，随便打打工的人生了。但是现在只要我想学习，就有翻盘的机会。但是也就是中产家庭，和大富大贵有很大差距。我有我爸妈这样的爸妈是我的幸运，他们有我这样的孩子不是他们的幸运。智力水平不高就算了，性格也不好。大家也别羡慕我吧，有得必有失。智商不行是硬伤啊。我本科的时候隔壁住着一个公费来交换的数学博士，我每次都馋人家智商。还有我的一个舍友是从国内某985转过来的，我的专业课是他的选修课。每次这位兄台都可以用我十分之一的努力拿到和我差不多的成绩。最后来一句，我觉得信息挺少的，老师放水了呀。我学的差点没被淹死。我是真的佩服家境贫寒，自学成才的学霸们。他们面对生活的困苦从不低头让我肃然起敬。他们的人格魅力闪闪发光。我知道，他们付出了比我更多的辛苦。他们不敢走错，一步都不敢。(我不想删答案，只是写个人感受，没有炫耀的意思，事实上作为优秀父母的平庸子女，内心也是很沮丧的，有些孩子生来就是父母的骄傲。而我只是上帝给他们的无可奈何的礼物罢了。大家族聚会，长辈们总是投以意味深长的眼神。我妈年轻的时候是明晃晃的大美人，类似张敏或者利智那个风格，我从外貌到智商都没遗传上。亲戚见面夸我是个老实本份的孩子，大家可以感觉下经常被人夸老实本份不惹祸是怎样的体验。不喜欢看就拉黑我好了，诅咒什么的就不必了，只是网友而已，没那么大仇）强行插入征婚硬广告。帮朋友，97年NTU博士生技术宅一枚寻求小仙女。有意者私聊。"
        },
        {
          tit: "有哪些你终生不想看第二遍的视频？",
          exef: true,
          ps: "张导演",
          ping: false,
          zhan: 1,
          ztt: true,
          scc: true,
          content:
            "《金陵十三钗》里面那段豆蔻被绑在椅子上轮奸，香兰死了肯定被奸尸了。   以前看过金陵十三钗这部电影的部分片段，一直没敢看。    就在刚刚我看完了金陵十三钗，不能说是看完了，看到刚刚那个片段看不下去了。    第一个画面是日本兵在水下把豆蔻抓回去   转镜头几个日本兵围着火堆晾晒湿透的衣服  两个镜头的暗示，我有点慌了。豆蔻被绑在椅子上被轮奸了   那个镜头我觉得一辈子可能都忘不了豆蔻抱着一根弦的琵琶给奄奄一息的蒲生弹琴。   她第一眼就感觉蒲生像她的弟弟，豆蔻对他很有好感。   豆蔻想让蒲生在最后的时间里听一首完整的曲儿，所以和想去取耳饰的香兰一起回去了。不出所料 路上遇害了    前面日本兵在教堂里想强奸学生们的那段，即使也很过分 但似乎又在心理能接受的范围内。   豆蔻露的不多。   一只被捆在椅子上的手臂，满是血的嘴，和最后一个日本兵压着她的镜头。也可能是作为女孩子的缘故，我那么一瞬间就生理性的呕吐。身临其境的感觉，实感恶心至极。"
        },
        {
          tit: "怎么跟领导谈工作？",
          exef: true,
          ps: "黑盒子",
          ping: false,
          zhan: 1,
          scc: true,
          ztt: true,
          content:
            "1、汇报工作说结果2、请示工作说方案3、总结工作说流程4、布置工作说标准同时，要做到:①讲结果，不讲理由；②讲重点，不讲细节；③讲数据，不讲大概；④汇报结果而不要邀功；⑤汇报不主动，工作很被动；⑥汇报不及时，节点会延迟；⑦汇报不越级，否则没章法；⑧汇报小事不能多讲，大事不能少讲；⑨汇报不可只报喜不报忧；⑩汇报时不可以批评他人。"
        },
        {
          tit: "如何改掉「想太多」的毛病？",
          exef: true,
          ps: "嘿嘿哈嘿",
          ping: false,
          zhan: 1,
          scc: true,
          ztt: true,
          content:
            "首先，我们来解决你为什么会想太多这个问题。 你为什么会想太多？为什么别人不会想太多？你为什么和别人不一样？ 因为天生的，你天生就会想太多，我自己的形容是，出生自带一架想太多纺织机，并且它爱啥时候开机就啥时候开机。 那别人为什么不会呢？因为人是社会性动物，很多事情都是协同合作来完成的，所以大自然给人类群体配备了各种不同属性的个体，会思考只是其中之一，其他人有他们各自的属性：比如，行动能力强；比如，对数字分外敏感；……不同属性的人精诚合作，完成了人类的各种壮举，推动了社会进步。 所以，会有一小撮人和你一样，而很多人和你不一样。 想太多，即思考，其实是你的天赋属性。远古时候，你可能是部落的祭司或领袖；古时候，你可能是军师、宰相、文人墨客……；现代，你可以是研究生、博士、企业高管、政客，文学家、哲学家、经济学家等很多需要进行大量思考的专家…… 想太多这种具备领袖气质的属性，往往是用来发表建议，指引方向，拟定决策的；如果出生在底层，则会非常痛苦，没有人会听你的，他们还会觉得你有毛病；如果出生在顶层，则非常幸运，聪慧而有远见的未来领导者。 在落后的社会或底层这种恶劣的环境里，人没有条件得到好的教育，天赋不会被人发现、保护和引导，相反，会被打压；这些环境里的群体是用来被收割的，不能任由他们自由发展，找到出路，更不容许未来的领袖得到成长，所以，这种环境里往往充斥着既得利益集团炮制的洗脑观点，反智条例。 比如，“你就是想太多！”“别想不就行了！”等等。这样就会诱导你把自身的天赋示为缺点，想要改掉。没有思想的人是最好控制的。 但，作为个体来说，这是对自身极大的浪费，且伴随着很大的痛苦。不能接纳自己是极其痛苦的。 想把自己的天赋这自身的一部分从身上挖去；想变成其它属性的人，因为他们在被剥削时没有会思考的人那么痛苦……但人天生的样子是无法改变的，只能被压抑，被扭曲，想象一下，把一个正常的人扭曲到各种可怕的样子，该有多痛苦。 这里，痛苦的来源其实根本不是想太多，而是无法接纳自己。 解决的方法：就是去接纳自己，了解自己，找到自己人生的出路，找到适合自己的位置，继续思考，去施展自己的天赋，过上更好的生活。 接着，我们来解决想太多痛苦怎么办这个问题。 前面我说过，想太多纺织机它是爱啥时候开就啥时候开的，并且一旦开动，它总要转好久才会停下来，不受人控制，这就是痛苦之一。 其实很多天赋都是如此，它们好像有自己的生命，并且天赋越强，越桀骜不驯。其实这是大自然不想让人们把自己的天赋浪费掉，浪费天赋就会痛苦，并且天赋越强大，越痛苦。这就是为什么很多聪明人，总是爱作死，好像无法过上正常的生活。我最近刚看的那不勒斯四部曲里的莉拉，就是个典型的例子，她有过人的天赋，却不得不浪费掉，于是，她总是带着疯狂的毁灭性，最终毁掉了自己的生活。 天赋，也需要后天的学习和训练，来让它得到发展。 想太多纺织机的开动，也是需要原料的，没有原料，空转就会让人痛苦，这时候，人就会怨恨自己想得多，还不如别人不想，生活舒畅。 提供一些劣质的原料，就会织出下等的作品，比如生活里的鸡毛蒜皮，各种微不足道的小事，就会让人变得在无所谓的事情上揪住不放，斤斤计较，过度敏感。这时人也会怨恨自己想得多，徒然增加了很多痛苦。 提供的原料不够，织不出作品。比如，很忧心自己以后的生活，但却对社会、政治和经济所知甚少，想不出答案，只能陷在焦躁的思考中，痛苦万分。 这时候，人往往会怪罪想太多纺织机，觉得如果它不存在就好了，不开动就好了，看别人没有这台纺织机多好，就没有这些痛苦。 但别人都是生活顺利，功成名就的吗？别人就没有现实生活里的烦恼和忧愁吗？人生在世，谁能不碰到难题和困境呢？每一项技能都有其自身的特质，有阴阳两面，总是只看到别人的好处和自己的坏处，是很愚蠢的，这样就会永远羡慕别人，永远对自己不满，就无法获得内心的平静，也找不到生活的出路。 你有没有想过，其实是你自己的问题，你没能给想太多纺织机提供足够好足够多的原料！因此你发挥不出自己的技能的阳面，即好的一面，只能不停地品尝阴面，即各种坏处，于是，你很痛苦。 孔子很久很久以前就说过：“学而不思则罔，思而不学则殆。”你其实就是殆的痛苦。 如果你能给想太多纺织机提供足够优秀的原料，它就能编织出精美的作品。你能思考出很多问题的答案，你能做出正确的人生规划、事业规划，你能解决生活里碰到的难题，度过难关。这时候，你就不会再怪罪想太多纺织机了，相反，会感激自己拥有了这项天赋。 比如，写毕业论文时，想太多纺织机就能帮助你思考，完成一篇优秀的论文；而其他没有这项天赋的学生，就得绞尽脑汁。 当你抬起头来，看到更广阔的世界，不要只拘泥于自身，只看到身边一方小小的世界，各种鸡毛蒜皮，勾心斗角，你就有了更好的材料提供给想太多纺织机，它就不用老是编织一些下等的作品，这时候过度敏感的问题就解决了。 如果你学会了优质输入，平时能进行高质量阅读、学习；学会了碰到问题去查阅资料；那想太多纺织机就不会老是卡壳。不是不要想太多，而是要想出答案。 三个阶段：不想，想不出答案，想出答案。当处于想不出答案的痛苦中时，是退回去不想，还是努力想出答案？退回去不想，生活的苦难就不存在了吗？而想出答案能让你解决问题，战胜困境，一步步发展自我，过上更好的生活。可悲的是，这时候很多人居然妄图挖掉思考的能力退回去！ 解决的方法：是学会使用和发挥自己的天赋，避免陷入技能的阴面，尽量享受技能的阳面带来的好处。 我给想太多纺织机提供的好多材料是名著，具体的内容在为什么很多名著大多人都看不下去，却仍被称为名著？这篇回答里。 我的好多文章都是它织出的作品。经常把它使用在这些方面，能大大降低对于生活琐事的关注，解决过度敏感的问题。 还可以发展出新的乐趣，和同类聊天，那种思想交流和碰撞的感觉，很愉悦。我最近和朋友聊了囤货的话题，大家都是生存狂又想得多，从囤货聊到安全屋，很开心。是纠结于鸡毛蒜皮导致社交苦恼，还是和好的对象聊天得到社交享受，其实是自己可以去选择的。 还有团队合作能力，每一项技能都有自己的长处和短处，想得多的人自然行动力便会差一些，学会挑选和合适的人合作，扬长避短，更能做好事情。 最后，总结一下：人生在于自己的选择。 是选择接纳自己，还是扭曲自己？是选择发挥自己的天赋，享受阳面带来的好处，还是浪费自己的天赋，承受阴面导致的反噬？ 很多人其实是无意识地被动地做出了错误的选择，从小被洗脑，被周围的环境影响而不自知。 对孩子，正确的引导和教育相当重要。如果从小教会孩子真正的学习和思考，那想太多纺织机从一开始就不会带来痛苦。 社会也是如此，是选择正确的教育和引导有天赋的孩子，让他们发挥作用，推动社会的进步；还是打压和洗脑，压制孩子的成长，以便于收割，牺牲社会发展。 人常常都在做着选择，很多人的选择又汇总为社会的选择。 希望大家都能意识到这一点，主动做出正确的选择，不要无意识地浪费掉自己的天赋和人生。"
        },
        {
          tit: "你在酒吧见过哪些令你震惊的事？",
          exef: true,
          ps: "梦游小伙",
          ping: false,
          zhan: 1,
          scc: true,
          ztt: true,
          content:
            "谢邀。这是我迄今为止最为糜烂、枯燥且肮脏的一段回忆。18年某日下午18:30，地点，Z州某健身会所。一个身高178，宽硕的膀子上搭着条毛巾的男孩走了出来，他点了支烟，在门口徘徊，细看，他脚上还穿了双假的A锥，他应该是在等什么人。这个男的就是我，当时还是大四学生，在健身会所做兼职教练。我要等的人，是我的一个女客户Anna，Anna，29岁，离异，身高175，性感大方。是字节tiaodong的高管，据悉税后年薪90w。她是我通过2分钟搭讪收到的学生，也是我兼职做教练以来最大的单子，一次买了我一年的课程，Anna很认可我，也帮我推荐了很多她身边的朋友，慢慢的我们的关系越来越好，甚至有点喜欢这个直爽开朗的女人。先后我们接触了6个月，这天，她说心理有点崩溃，想去蹦迪。Anna说酒吧才是青春乐园，为了安全起见，要带上我。自我评价来说我（绝逼不是）是个老实人，这是我人生中第一次去酒吧，由于心理紧张。总觉得去了酒吧就得打架。小心的备上了10公分的平口螺丝刀。等了有20分钟，一辆黑色MKZ停在门口，落下车窗，Anna冲我一笑。“来，你开车！带驾照了吗？”没问题，带了，我一边拿出来我科目二挂了3次的驾照支支吾吾道。三十分钟后，我们到达了目的地春馨酒吧。门口接待的规格很高，负责接待的是一个脖子上挂了三四条金项链的刘总，一口一个周姐喊着。Anna也不吝啬，拿起来准备好的5000现金，“再充5000，这位是我们公司杨总”听着这样的介绍，我不禁放了个冷屁。等我下老师（Anna平时喊我杨老师），我去换衣服。Anna冲我一笑，去更衣室了。向来儒雅大方（猥琐）的我，看着眼前近乎疯狂的人们，大厅里超级难听的音乐配合着五颜六色的射灯，有些头痛，觉得实在是无趣。突然一双手从后面搂着我的腰，我左数第三块腹肌（腹肌真的有）突然紧张了，猛地一回头，我被惊艳到了Anna穿着酒红色的裙子，脖子上白皙的皮肤一点也不显老。Anna好像很兴奋，我们去喝酒维斯给吧？维斯给？突然间一大堆英文闪过我的脑袋，维斯给？维斯给？想起来了Whiskey，烈酒。（很开心啊，那么多年英语课没白睡）喝了一会儿，我们两个去了包厢，Anna要我唱毛阿敏的《相思》，这时突然对Anna心生同情，觉得平日里不怎么走心的她，也是情种。..    ..    ..   ..   ..  领导视察，我先撤  ..   ..   ..   ..   ..   ..    正准备唱，大金链子（刘总）过来了，拍了拍手，进来两个精神小伙，一个绿（头发）的，一个黄的。工装西裤整整齐齐，长得比较细腻，但脂粉涂的有点重。操着一口不太舒服的台湾腔，很高兴为您服务（hen gao sing wei nin fu wu）然后来了个一个60度鞠躬。“周总，这两个都是边上＊＊高中的，年轻，劲儿大。”（？？？瘦胳膊瘦腿儿，倆不良少年，日尼玛这是啥品味）“费心费心，老刘辛苦”说完大金链子小心的关上门。Anna搂着小黄和小绿两个人唱了两首周杰伦的歌，现在屋里，我们三个男的，一个女的。大眼瞪小眼。周总搂了搂小绿的腰，另一只手摸了摸小黄。Anna给了小绿一个眼色，没过会儿她们去了包间的卫生间里。这边小黄很懂事，调大了KTV伴奏的音量。然后一脸无辜的看着我说，“哥。咱俩在这儿就行”，不知道什么原因，他的这句话让我感觉到有些羞辱和恼怒，压制住挥拳的冲动，“闭上你的嘴”！我严厉的警告他！剩下的半个小时里，音响里羞答答的玫瑰静悄悄得开，伴随着卫生间的不可描述的声音。我第一次感觉三观被摧毁。小绿跟Anna出来后，衣衫不整，躺在大沙发上睡了，酒红色长裙下透漏着Anna皙白的腿，心理暗暗嘀咕，觉得交友不慎。我走出包间，坐在舞厅的一侧，享受着whiskey带来的强烈刺激，看着眼前年轻男女们各种肢体接触和欢呼。似乎有些麻木。拿起手机，听着“醉卧不夜城，处处霓虹，酒杯中好一片滥滥风景”当晚不知道喝了多少，当我醒来的时候已经赤身裸体的躺在Anna的家里。头痛伴随着乏累，看了看手机，已经是上午11:30了，Anna告诉我，昨天我喝的太多，水都滋不醒。衣服都吐脏了。已经帮我定了海澜之家的青春套装。晚一点送过来。“我可没有占你便宜啊，昨天晚上我也有点多，老刘派人送的咱们”她似乎想起来了什么，就没有再说。（应该是前一天晚上在包间里＊＊的事情）过了一会儿我匆匆换上衣服，听着Anna在厨房里做饭的声音。我悄悄离开了。我觉得思想备受打击，我停了健身房的兼职，和Anna做了简单的告别。后来的几个日子里，Anna一直给我发信息联系我，打电话带着哭腔，“我有点想你了。我们去大理旅个游吧”我的良知告诉我应该远离这个肤浅的女人。经过几次谈话。我答应见面一起吃个饭，Anna见到我向我跑过来，差一点就钻进我怀里。我下意识的往后退了一步。我们在西餐厅里聊了一个小时，她告诉我，“很抱歉那天晚上我不知耻的放着你的面做了些事情，我知道为此你对我会有些嫌弃，我很喜欢你，但是有些事情对我的打击比较大，我心态崩了，所以才做了那些事情”说到这里我已经很不耐烦了，我把海澜之家的衣服8000块钱，还有她的私教课的钱23000一并给了她，转身就走了。时间过了一年多，一年多里，我已经实习了，找了专业对口的工作，取得了一些个人成果。在我觉得充实的日子里，终于还是被她一通电话打乱了思绪。“老师，是我Anna，很长时间没联系你了，现在混的怎么样啊？需不需要我帮你调个岗位？”听到是她我真的没一点耐心。“Anna，您有事儿吗？如果没事儿别再烦我”那边的Anna听完就大哭，我也没问，就挂了电话。一个月后，我收到了Anna的一则短信。杨，我想了很久，很多次想对你表白，但是因为一些原因始终未开口，我觉得我还是应该说出来，我喜欢你，近乎疯狂！我们相识的第一个月我就喜欢上你了。我发现第二个月就查出来了乳腺癌。我看的出来你喜欢我。从来没有向你讲过我的感情事，我的老公join是德国人，在我23岁的时候我们日本认识，在中国结婚。之前我们有过一对双胞胎宝贝，但是在还未出生之前查出来了畸形。只能是打胎。前几年一直没有走出阴影，Join也变得暴躁。家暴的同时，出轨了他在德国的女同事。并且在德国结婚了。官司打了两三年无果。我也不想折腾了。说服了家人之后，我就留在Z州，浑浑噩噩。知道我遇见了你，当我查查出来乳腺癌的时候，我接近崩溃了，我怕我再也离不开你。所以我不理智的做出了那样的事情，逼走你。我怕你一旦对我动了情，就成为你的累赘。上次跟你打电话，隔了也有些日子了，做了好几次化疗了，无果。我想在最后清醒的时间里，告诉你我爱你。就像夏天遇见了风，所以日子开始有了冷暖。我在最疼痛的时候拨通你的手机，我想听到你的声音。得到的虽然是你的呵斥，但是能感受到你，已经是对我最大的鼓励。当你看到这个信息，我周明婉已经向这个世界挥手告别了。我对不住父母，对不住曾经失去两个小天使。但我现在舍不得的还是你。老师，以后你就不要做私教了，我想让你一想起来健身房，就想到我。但是我又怕你想到我不开心。是我自私了。我爱你，且哔哔赖赖。19年7月，我去了Anna的老家太原，找到了她的父母，告诉他们我是明婉的朋友，告诉他们我喜欢周明婉。你们把我当儿子看就好。需要就打电话，需要就联系我。Anna的哥哥是个包工头，很客气接待了我，告诉我Anna的信息是最后一次化疗前编辑的，嘱咐哥哥，在Anna后事办完后发给我。并带我去了Anna的房间，贴了一张我去广州健美比赛的制成的海报。临走前，她哥哥说，这里有Anna的日记，你要是看，就拿走。我没回复，我觉得包袱太重，我怕我放不下。过了段时间Anna的朋友来找我，拿了些Anna名下2辆车的代办过户资料。我拒绝了。后来，春馨酒吧里，我成了常客，一个人喝酒，一个人迷醉。大金链子送我回家。一天小绿喝多了告诉我说，那天她在包间里一直哭，两个人什么都没做，Anna给了3000封口费。他诧异的不得了。很多事情我都是后知后觉。到底谁肤浅呢？大概就是昨天刚从春馨酒吧里迷醉的我吧。第一次写那么多东西，文笔不好，各位看看就行。别骂人哈，我是个暴脾气。 我今天去做核酸检测…………………………………………有些故事，还没写完，作者就被隔离了。。。今日隔离第三天，忙里偷闲来更新Anna走后，一度让我感觉到生活越来越迷茫，也许是我本来就迷茫，在学校周边租个房子，消费着信用卡，浑浑噩噩的待了两个月。期间办理4张信用卡，消费了9W，终于我把自己的前途推向了悬崖边。2019年10月，疫情来的突然，物价飞涨，眼看着信用卡额度越来越少，无力支撑我颓废的生活。待业的焦虑和不稳定的情绪愈发让我深感空虚。一个夜晚，一场秋雨，带着初寒。我迷迷糊糊起来关窗户，我闻到了泥土的气息，让我感到久违的心安，闪电刺破夜空，雷声配合着大雨猛烈的冲击我的耳膜。是什么让我走到现在这一步？我愤怒锤碎了窗户，我突然看到地上的玻璃碎片倒映出了Anna的面孔，我问她为什么我会遇见你？为什么遇见你开始我的一切都开始戏剧化？是你想看如今狼狈的我吗？还是想看到我现在多么想念你？Anna似笑非笑，眼角流露一丝不屑，好像要说什么，我听不清，大声一点，我听不清！我对着玻璃碎片喊着，我把耳朵狠狠的贴到玻璃碎片上，发生的告诉她。Anna，我爱你！不知道为什么要哭，哭了一整夜。第二天眼睛的痛感刺醒了我，我睁开眼睛，一层黑乎乎的粘液在我眼皮上结了痂，我用力抠下，好痛！我转向身后的镜子，耳朵已经被玻璃扎地血肉模糊了。当我走进时，仔细看了看我浑身上下，我脱下所有的衣服，赤裸的现在镜子前。我问自己，真的废了吗？我想起我爹的戏剧化“当你发现自己漫无目的的时候，你先离开你现在的环境，看看那些你崇拜的人都活成了什么样子”我起身去卫生间，把自己冲的干干净净。整理一下伤口，收拾好的衣物，联系快递发到了家里。找到房东，告诉他退租。把手机恢复出厂设置。去吃了个早餐。然后买上了帝都的高铁票。帝都第一天下车之后，地图上找到了一家青年旅社。安顿了下来，夜晚，内心作祟的我辗转反侧，我开始拿起笔记本记录了我从认识Anna开始的每一天，我回忆每个细节和她的每句话。我把时间排开时突然脑海里有一丝疑惑，我开始怀疑我的眼睛，蒙蔽了我的大脑！在家办公啦，任务太鸡儿多……今儿到这儿。"
        },
        {
          tit: "社会都已经这么骂百度了，为什么百度还没有做出明显改变？",
          exef: true,
          ps: "社会企业家",
          ping: false,
          zhan: 1,
          scc: true,
          ztt: true,
          content:
            "恐怕这世界上只剩两家好企业了：一家是华为创始人任正非所说的：“谷歌是一家好公司”；另一家是著名的思想觉悟家沃兹基所说的：“360是一家好流氓公司”！前者，带动着世界互联网和软件公开、开源的脚步；后者，贯彻免费忍道的周先生，以一己之力杜绝了好几次国内互联网差点的垄断 (想用户、重创新、反垄断是360前进的永久动力)，同时还以自己最强流氓的能力，帮助我们大家、普通用户杜绝了所有其他流氓对我们电脑的危害！！！"
        }
      ]
    };
  },
  methods: {
    sc(i) {
      i.scc = !i.scc;
      if (i.scc) {
        this.sc1.splice(i,1);
        
      } else {
        this.sc1.push(i);
        
      }
      
       this.bus.$emit('sc',this.sc1)
    },

    jia(i) {
      i.ztt = !i.ztt;
      if (i.ztt) {
        i.zhan -= 1;
        console.log(i.ztt);
      } else {
        i.zhan += 1;
        console.log(i.ztt);
      }
    },

    show1: function(i) {
      i.exef = false;
    },
    hid: function(i) {
      i.exef = true;
    }
  },
  beforeMount: function() {
    setTimeout(() => {
      this.login = false;
    }, 500)
      
  },

  components: {
    gu,
    show
  }
};
</script>
<style scoped>
.hidbg {
  width: 600px;
  margin: 10px;
  padding: 10px 10px 0px 10px;
  position: relative;
}
.showbg {
  width: 600px;
  margin: 10px;
  padding: 20px 20px 0px 10px;
  font-size: 14px;
}
.show {
  overflow: hidden;
  text-overflow: clip;
  display: -webkit-box;
  -webkit-box-orient: vertical;
  -webkit-line-clamp: 2;
  font-size: 14px;
}
.hidbut {
  text-align: right;
}
.down {
  display: inline-block;
  width: 8px;
  height: 8px;
  border-right: solid 1px;
  border-bottom: solid 1px;
  transform: rotate(45deg);
  margin-bottom: 3px;
}
.up {
  display: inline-block;
  width: 8px;
  height: 8px;
  border-left: solid 1px;
  border-top: solid 1px;
  transform: rotate(45deg);
  margin-top: 3px;
}

.sq {
  line-height: 40px;
  color: #0084ff;
}
.x {
  border-bottom: 1px solid #f0f2f7;
}
</style>